primeraReunion.org
* Primera reunion
Fecha: <2023-10-20 Fri>

** Apuntes natalia
- https://www.iforce2d.net/b2dtut (Box2d)
- https://lazyfoo.net/tutorials/SDL/ (SDL2)
- https://doc.qt.io/qt-5/qtexamplesandtutorials.html (Qt5)
- https://gameprogrammingpatterns.com/game-loop.html (GameLoop)
- https://book-of-gehn.github.io/articles/2019/10/23/Constant-Rate-Loop.html (Constant Rate Loop)
- https://github.com/catchorg/Catch2 (Libreria para tests automatizados)
- https://book-of-gehn.github.io/articles/2019/10/23/Constant-Rate-Loop.html (Constant Rate Loop)
** Estructura natalia
- Monitor de partidas
- Clientes
  - Recibe
    - Referencia al monitor de partidas:
      El que llega le dice si quiere ir a una nueva o una partida existente. Es solo al inicio. _Hacer null despues de usarlo?_
- Partida:
  - Cada partida corre en un hilo propio

*** Cliente lara
- Ahora la onda es *NO* bloqueante. Si no hay interaccion por x cantidad de tiempo, se cierra.
- Poner un delay para que no haya un busy wait.
- Recibir y enviar estan en threads distintos.
- Como manejar los eventos?
  - 4to hilo? Que haga de "despacher" de acciones. Cola bloqueante que le manda al render aka main. **USAR FUNCION DE SDL**. Gracias Juampi!!!!. Filtrar los eventos. Solo enviar al servidor los eventos que el servidor tiene que saber. Eventos como agrandar la pantalla, mutear, etc son propios del cliente.
  - Cola "no bloqueante" en el main
- Recibe *todo* el estado del juego. DTO?
- Acciones. Muchas que heredan de clase.

** Division de tareas recomendacion
1. Juego parte servidor. Box2d. Que se pueda mover: *Fabri*
2. Cliente.Renderizar sdl2: *Juampi*
3. Protocolo, concurrencia: *Anto*
   1. Hay que hacer tests para serializacion y desearilazacion. Arrancar. Separar serializacion y desearilazacion de la parte de enviar.

** Protocolo 
*** Protocolo cliente->servidor
- Crear partida
- Unirse (ID)
- Moverse (Direccion)

*** Protocolo servidor->cliente
- Partidas disponibles (N IDS, [ID1...])
- Estado del juego inicial (Con vigas + agua [splash splash])
- Actualizacion (N Gusanos, [posx 1, posy 1, vida 1...])
